--创建NPC
local function createnpc()
    --NPCID
    local id = 1
    --NPC名字
    local name = "test npc"
    --形象
    local shape = "tset001"
    --朝向,8个
    local direction = 1
    --是否是自动行动NPC
    local auto = false
    --地图坐标,三个坐标一组{mapid,mapx,mapy},可以有多个,如果是行动类NPC，同地图自动移动，不同地图飞过去后自动移动
    local map = {
        {1000, 100, 100},
        {1000, 200, 200},
        {2000, 100, 100},
        {2000, 200, 200}
    }
    --对话,默认执行最前面一条说话或者对话框,如果带有密语类型，优先判断密语类型
    local dialog = {
        [0] = {"今天天气真好", "normarl"}, --说话类型
        [1] = {"你好!", "dialog", {{1, 10, 4}, {0, 0, 10}}}, --对话框型,{{0, 0, 4}, {0, 0, 10}}为对话框选项，第一个0前置对话ID，第二个0是前置对话ID执行次数,第三个数是目前显示的对话选项
        [2] = {"打开商店", "shop", {1, 2}}, --商店类型,{1,2}表示两个shop对应的商店，如果只配置一个，则直接打开商品界面
        [3] = {"密语", "privatekey", "密语内容", 2}, --密语类型,内容一样就打开对应的对话ID
        [4] = {"传送", "send", 0, {1001, 100, 1000}}, --传送类型,{1001, 100, 1000}为地图坐标,0表示传送NPC,1表示传送说话的玩家
        [10] = {"关闭", "close"}
    }
    --商店设置,可以有多个商店页面
    local shop = {
        [1] = {},
        [2] = {}
    }
    --触发事件
    local evet = {}
end
